var myChart = echarts.init(document.getElementById('stationdays'));
        var option = {
        	 	title : {
			        text: '',
			        subtext: '集团各水电站发电量日对比图'
			    },
			    tooltip : {
			        trigger: 'axis'
			    },
			    legend: {
			        data:['水电站001','水电站002','水电站003','水电站004','水电站005','水电站006']
			    },
			    toolbox: {
			        show : false,
			        feature : {
			            mark : {show: true},
			            dataView : {show: true, readOnly: false},
			            magicType : {show: true, type: ['line', 'bar', 'stack', 'tiled']},
			            restore : {show: true},
			            saveAsImage : {show: true}
			        }
			    },
			    calculable : false,
			    xAxis : [
			        {
			            type : 'category',
			            boundaryGap : false,
			            data : ['1日','2日','3日','4日','5日','6日','7日','8日','9日','10日','11日','12日','13日','14日','15日','16日','17日','18日','19日','20日','21日','22日','23日','24日','25日','26日','27日','28日','29日','30日','31日']
			        }
			    ],
			    yAxis : [
			        {
			            type : 'value'
			        }
			    ],
			    series : [
			        {
			            name:'水电站001',
			            type:'line',
			            stack: '总量',
			            data:[120, 132, 101, 134, 90, 230, 210,120, 132, 101, 134, 90, 230, 210,120, 132, 101, 134, 90, 230, 210,120, 132, 101, 134, 90, 230, 210,120, 132, 101]
			        },
			        {
			            name:'水电站002',
			            type:'line',
			            stack: '总量',
			            data:[220, 182, 191, 234, 290, 330, 310,220, 182, 191, 234, 290, 330, 310,220, 182, 191, 234, 290, 330, 310,220, 182, 191, 234, 290, 330, 310,220, 182]
			        },
			        {
			            name:'水电站003',
			            type:'line',
			            stack: '总量',
			            data:[150, 232, 201, 154, 190, 330, 410,150, 232, 201, 154, 190, 330, 410,150, 232, 201, 154, 190, 330, 410,150, 232, 201, 154, 190, 330, 410,150, 232, 201]
			        },
			        {
			            name:'水电站004',
			            type:'line',
			            stack: '总量',
			            data:[320, 332, 301, 334, 390, 330, 320,320, 332, 301, 334, 390, 330, 320,320, 332, 301, 334, 390, 330, 320,320, 332, 301, 334, 390, 330, 320,320, 332, 301]
			        },
			        {
			            name:'水电站005',
			            type:'line',
			            stack: '总量',
			            data:[820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901]
			        },
			        {
			            name:'水电站006',
			            type:'line',
			            stack: '总量',
			            data:[920, 992, 909, 934, 129, 133, 132,820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901, 934, 1290, 1330, 1320,820, 932, 901]
			        }
			    ]
			};
        myChart.setOption(option);